# Data Preparation and Cleaning Lab

Given a dataset with Air Quality for London based on various species.

Courtesy : https://www.londonair.org.uk/london/asp/datasite.asp?CBXSpecies2=NOm&CBXSpecies3=NO2m&CBXSpecies4=NOXm&CBXSpecies5=O3m&CBXSpecies6=PM10m&day1=1&month1=jan&year1=2018&day2=1&month2=jan&year2=2019&period=hourly&ratidate=&site=BL0&res=6&Submit=Replot+graph

Based on the dataset, you are required to do the following:

1. Clean/handle missing values
2. Detect and remove outliers in the data
3. Remove skewness in data

In [1]:
import pandas as pd

air_data = pd.read_csv('../../../data/LaqnData.csv')
air_data.head()

#Write your code below

  Site Species   ReadingDateTime  Value   Units Provisional or Ratified
0  BL0      NO  01/01/2018 00:00    2.5  ug m-3                       R
1  BL0      NO  01/01/2018 01:00    1.9  ug m-3                       R
2  BL0      NO  01/01/2018 02:00    1.8  ug m-3                       R
3  BL0      NO  01/01/2018 03:00    0.9  ug m-3                       R
4  BL0      NO  01/01/2018 04:00    0.9  ug m-3                       R

In [2]:
air_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43800 entries, 0 to 43799
Data columns (total 6 columns):
Site                       43800 non-null object
Species                    43800 non-null object
ReadingDateTime            43800 non-null object
Value                      36287 non-null float64
Units                      43800 non-null object
Provisional or Ratified    43800 non-null object
dtypes: float64(1), object(5)
memory usage: 2.0+ MB

In [3]:
def missing_values_table(df):
        mis_val = df.isnull().sum()
        mis_val_percent = 100 * df.isnull().sum() / len(df)
        mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
        mis_val_table_ren_columns = mis_val_table.rename(
        columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        mis_val_table_ren_columns = mis_val_table_ren_columns[
            mis_val_table_ren_columns.iloc[:,1] != 0].sort_values(
        '% of Total Values', ascending=False).round(1)
        print ("Your selected dataframe has " + str(df.shape[1]) + " columns.\n"      
            "There are " + str(mis_val_table_ren_columns.shape[0]) +
              " columns that have missing values.")
        return mis_val_table_ren_columns

In [4]:
missing_values_table(air_data)

Your selected dataframe has 6 columns.
There are 1 columns that have missing values.

       Missing Values  % of Total Values
Value            7513               17.2

In [5]:
air_data.Site.unique()

array(['BL0'], dtype=object)

In [6]:
air_data.Species.unique()

array(['NO', 'NO2', 'NOX', 'O3', 'PM10'], dtype=object)

In [7]:
air_data.Units.unique()

array(['ug m-3', 'ug m-3 as NO2', 'ug/m3'], dtype=object)

In [8]:
air_data['Provisional or Ratified'].unique()

array(['R', 'P'], dtype=object)

In [12]:
data = air_data.groupby('Species')
data.describe()

          Value
          count       mean        std  min   25%   50%   75%        max
Species
NO       8567.0  11.484230  18.802801  0.0   1.7   4.9  13.5  256.29999
NO2      8567.0  36.463254  18.385162  0.0  22.6  34.4  48.0  126.60000
NOX      2343.0  71.523261  42.649111  2.9  40.8  62.3  95.0  485.79999
O3       8535.0  35.084663  23.020574  0.0  17.8  33.5  48.5  143.89999
PM10     8275.0  17.570356  11.739188 -0.6  10.1  14.8  21.7  202.70000